const hoildayList: TimeItem[] = [
  { y: '2024', m: '1', d: '1', cd: '一', s: '1', t: '元旦', hd: '元旦' },
  { y: '2024', m: '2', d: '10', cd: '六', s: '1', t: '春节', hd: '春节' },
  { y: '2024', m: '2', d: '11', cd: '日', s: '1', t: '', hd: '春节' },
  { y: '2024', m: '2', d: '12', cd: '一', s: '1', t: '', hd: '春节' },
  { y: '2024', m: '2', d: '13', cd: '二', s: '1', t: '', hd: '春节' },
  { y: '2024', m: '2', d: '14', cd: '三', s: '1', t: '情人节 七九', hd: '春节' },
  { y: '2024', m: '2', d: '15', cd: '四', s: '1', t: '', hd: '春节' },
  { y: '2024', m: '2', d: '16', cd: '五', s: '1', t: '', hd: '春节' },
  { y: '2024', m: '2', d: '17', cd: '六', s: '1', t: '', hd: '春节' },
  { y: '2024', m: '4', d: '4', cd: '四', s: '1', t: '清明', hd: '清明' },
  { y: '2024', m: '4', d: '5', cd: '五', s: '1', t: '', hd: '清明' },
  { y: '2024', m: '4', d: '6', cd: '六', s: '1', t: '', hd: '清明' },
  { y: '2024', m: '5', d: '1', cd: '三', s: '1', t: '劳动节', hd: '劳动节' },
  { y: '2024', m: '5', d: '2', cd: '四', s: '1', t: '', hd: '劳动节' },
  { y: '2024', m: '5', d: '3', cd: '五', s: '1', t: '', hd: '劳动节' },
  { y: '2024', m: '5', d: '4', cd: '六', s: '1', t: '青年节', hd: '劳动节' },
  { y: '2024', m: '5', d: '5', cd: '日', s: '1', t: '立夏', hd: '劳动节' },
  { y: '2024', m: '6', d: '8', cd: '六', s: '1', t: '', hd: '端午节' },
  { y: '2024', m: '6', d: '9', cd: '日', s: '1', t: '', hd: '端午节' },
  { y: '2024', m: '6', d: '10', cd: '一', s: '1', t: '端午节', hd: '端午节' },
  { y: '2024', m: '9', d: '15', cd: '日', s: '1', t: '', hd: '中秋节' },
  { y: '2024', m: '9', d: '16', cd: '一', s: '1', t: '', hd: '中秋节' },
  { y: '2024', m: '9', d: '17', cd: '二', s: '1', t: '中秋节', hd: '中秋节' },
  { y: '2024', m: '10', d: '1', cd: '二', s: '1', t: '国庆节', hd: '国庆节' },
  { y: '2024', m: '10', d: '2', cd: '三', s: '1', t: '', hd: '国庆节' },
  { y: '2024', m: '10', d: '3', cd: '四', s: '1', t: '', hd: '国庆节' },
  { y: '2024', m: '10', d: '4', cd: '五', s: '1', t: '', hd: '国庆节' },
  { y: '2024', m: '10', d: '5', cd: '六', s: '1', t: '', hd: '国庆节' },
  { y: '2024', m: '10', d: '6', cd: '日', s: '1', t: '', hd: '国庆节' },
  { y: '2024', m: '10', d: '7', cd: '一', s: '1', t: '', hd: '国庆节' }
];

const hoildayMap = new Map<string, TimeItem>();

export function getHoildayMap(): Map<string, TimeItem> {
  if (hoildayMap.size > 0) return hoildayMap;
  return hoildayList.reduce((map, h) => {
    map.set(`${h.m}/${h.d}`, h);
    return map;
  }, hoildayMap);
}

export default hoildayList;
